Config/Documents/ЮЦАУ_УстановкаОсновныхМаршрутовТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЮЦАУ_УстановкаОсновныхМаршрутовТС</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияТоваровНаСкладе</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЮЦАУ_ОсновныеМаршрутыТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗаполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеМаршрутыТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮЦАУ_Маршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ЮЦАУ_ОсновныеМаршрутыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЮЦАУ_ОсновныеМаршрутыТС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮЦАУ_Маршруты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/AccumulationRegisters/ЮЦАУ_ОборотыПоМаршрутам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЮЦАУ_ОборотыПоМаршрутам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РабочееВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПассажиров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕздок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробегСПассажирами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮЦАУ_Маршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Documents/ЮЦАУ_УстановкаОсновныхМаршрутовТС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	//МассивНепроверяемыхРеквизитов = Новый Массив();
	//
	//ЭтоСписаниеСоСклада = (ВидОперации = Перечисления.ВидыОперацийСписаниеТоваров.СписаниеСоСклада);
	//ЭтоСписаниеССотрудника = (ВидОперации = Перечисления.ВидыОперацийСписаниеТоваров.СписаниеССотрудника);

	//Если ПроверяемыеРеквизиты.Найти("Склад") = Неопределено И ЭтоСписаниеСоСклада Тогда
	//	ПроверяемыеРеквизиты.Добавить("Склад");
	//КонецЕсли;
	//
	//Если ЭтоСписаниеССотрудника Тогда
	//	МассивНепроверяемыхРеквизитов.Добавить("Склад");
	//КонецЕсли;
	//
	//Если ЭтоСписаниеСоСклада Тогда
	//	МассивНепроверяемыхРеквизитов.Добавить("Сотрудник");
	//КонецЕсли;

	//СпособОценкиТоваровВРознице = УчетнаяПолитика.СпособОценкиТоваровВРознице(Организация, Дата);
	//УчетВПродажныхЦенах = (СпособОценкиТоваровВРознице = Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);
	////ТипСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ТипСклада");
	//
	//ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	
	// При групповом перепроведении реквизиты документов не меняются,
	// поэтому обновление связанных данных выполнять не требуется.
	Если ПроведениеСервер.ГрупповоеПерепроведение(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Для Каждого ТекСтрока Из ОсновныеМаршрутыТС Цикл
		
		НовоеДвижение = Движения.ЮЦАУ_ОсновныеМаршрутыТС.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовоеДвижение, ТекСтрока);

		НовоеДвижение.Период = Дата;
		НовоеДвижение.Подразделение = Подразделение;
			
	КонецЦикла;	
	
	Движения.ЮЦАУ_ОсновныеМаршрутыТС.Записать(Истина);	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
	РаботаСПоследовательностями.ОтменитьРегистрациюВПоследовательности(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ЗаполнитьОсновныеМашрутыТСПоОборотамПериода(Организация, Подразделение, ДатаПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение КАК Подразделение,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Маршрут КАК Маршрут,
		|	СУММА(ЮЦАУ_ОборотыПоМаршрутамОбороты.РабочееВремяОборот) КАК РабочееВремяОборот,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.СчетЗатрат КАК СчетЗатрат
		|ПОМЕСТИТЬ ВТ_ОборотыПоТС
		|ИЗ
		|	РегистрНакопления.ЮЦАУ_ОборотыПоМаршрутам.Обороты(&ДатаНач, &ДатаКон, Период, ) КАК ЮЦАУ_ОборотыПоМаршрутамОбороты
		|ГДЕ
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Организация = &Организация
		|	И ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение = &Подразделение
		|	И НЕ ЮЦАУ_ОборотыПоМаршрутамОбороты.Маршрут В (&СписокМаршрутовИсключений)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Подразделение,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Маршрут,
		|	ЮЦАУ_ОборотыПоМаршрутамОбороты.СчетЗатрат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОборотыПоТС.ТранспортноеСредство КАК ТранспортноеСредство,
		|	МАКСИМУМ(ВТ_ОборотыПоТС.РабочееВремяОборот) КАК РабочееВремяОборот,
		|	ВТ_ОборотыПоТС.СчетЗатрат КАК СчетЗатрат
		|ПОМЕСТИТЬ ВТ_МаксимумПоТС
		|ИЗ
		|	ВТ_ОборотыПоТС КАК ВТ_ОборотыПоТС
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ОборотыПоТС.ТранспортноеСредство,
		|	ВТ_ОборотыПоТС.СчетЗатрат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОборотыПоТС.Маршрут КАК Маршрут,
		|	ВТ_ОборотыПоТС.Подразделение КАК Подразделение,
		|	ВТ_ОборотыПоТС.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_МаксимумПоТС.РабочееВремяОборот КАК РабочееВремяОборот,
		|	ВТ_ОборотыПоТС.СчетЗатрат КАК СчетЗатрат
		|ИЗ
		|	ВТ_ОборотыПоТС КАК ВТ_ОборотыПоТС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_МаксимумПоТС.ТранспортноеСредство КАК ТранспортноеСредство,
		|			ВТ_МаксимумПоТС.РабочееВремяОборот КАК РабочееВремяОборот
		|		ИЗ
		|			ВТ_МаксимумПоТС КАК ВТ_МаксимумПоТС) КАК ВТ_МаксимумПоТС
		|		ПО ВТ_ОборотыПоТС.ТранспортноеСредство = ВТ_МаксимумПоТС.ТранспортноеСредство
		|			И ВТ_ОборотыПоТС.РабочееВремяОборот = ВТ_МаксимумПоТС.РабочееВремяОборот
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТранспортноеСредство
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	сзИсключенияМаршрутов = Новый СписокЗначений;
	сзИсключенияМаршрутов.Добавить(Справочники.ЮЦАУ_Маршруты.ПустаяСсылка(),);

	Маршрут_Перегон = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Маршрут_Перегон", Организация, КонецМесяца(ДатаПериода));
	Маршрут_Резерв = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Маршрут_Резерв", Организация, КонецМесяца(ДатаПериода));

	Если Маршрут_Перегон <> Неопределено Тогда
		сзИсключенияМаршрутов.Добавить(Маршрут_Перегон,);
	КонецЕсли;	
	Если Маршрут_Резерв <> Неопределено Тогда
		сзИсключенияМаршрутов.Добавить(Маршрут_Резерв,);
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("СписокМаршрутовИсключений", сзИсключенияМаршрутов);
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ДатаПериода));
	Граница = Новый Граница(КонецМесяца(ДатаПериода), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ДатаКон", Граница);

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ОсновныеМаршрутыТС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет документ на основании другого документа
//
// Параметры:
//  ДанныеЗаполнения - ДокументСсылка
//
Процедура ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения)

КонецПроцедуры

#КонецОбласти

#КонецЕсли
